package test;

import com.google.common.collect.Maps;
import concurrent.CommonThreadPool;

import java.util.ArrayList;
import java.util.List;
import java.util.Map;
import java.util.concurrent.Future;

/**
 * Created by meicai on 2018/10/24.
 */
public class Main {

    public static void main(String[] args) {
        String str = "[\n" +
                "{\"id\":\"9329\",\"name\":\"三明福圆贸易有限公司\",\"bankNo\":\"102395060134\"},\n" +
                "{\"id\":\"16140\",\"name\":\"凌河区胖姐食品经销处\",\"bankNo\":\"313227000158\"},\n" +
                "{\"id\":\"7269\",\"name\":\"北京亿鑫恒业粮油贸易有限公司\",\"bankNo\":\"402100000464\"},\n" +
                "{\"id\":\"16128\",\"name\":\"北京四方方园粮油有限公司\",\"bankNo\":\"104100005274\"},\n" +
                "{\"id\":\"7705\",\"name\":\"北京市奥顺兴时代商贸有限责任公司\",\"bankNo\":\"103100012011\"},\n" +
                "{\"id\":\"7277\",\"name\":\"北京汇兴福盛商贸有限公司\",\"bankNo\":\"105100018050\"},\n" +
                "{\"id\":\"7713\",\"name\":\"北京鑫银顺贸易有限公司\",\"bankNo\":\"313100000208\"},\n" +
                "{\"id\":\"17024\",\"name\":\"十堰和元捷实业发展有限公司\",\"bankNo\":\"103523023923\"},\n" +
                "{\"id\":\"14248\",\"name\":\"南京慈嘉农业科技有限公司\",\"bankNo\":\"105301001090\"},\n" +
                "{\"id\":\"10989\",\"name\":\"南宁市五丰工贸有限公司\",\"bankNo\":\"313611015041\"},\n" +
                "{\"id\":\"13384\",\"name\":\"南平市建阳区餐友粮油商行\",\"bankNo\":\"403401400027\"},\n" +
                "{\"id\":\"9325\",\"name\":\"厦门创钰商贸有限公司\",\"bankNo\":\"105393000097\"},\n" +
                "{\"id\":\"10089\",\"name\":\"厦门市信孚米业有限公司\",\"bankNo\":\"305393000010\"},\n" +
                "{\"id\":\"9317\",\"name\":\"厦门鑫禾兴粮油贸易有限公司\",\"bankNo\":\"102393000702\"},\n" +
                "{\"id\":\"12076\",\"name\":\"呼和浩特市昕百隆商贸有限公司\",\"bankNo\":\"105191066252\"},\n" +
                "{\"id\":\"16144\",\"name\":\"唐山市龙兴酒店用品有限公司\",\"bankNo\":\"301124001049\"},\n" +
                "{\"id\":\"9333\",\"name\":\"宁德市丰登粮油贸易有限公司\",\"bankNo\":\"409158374420\"},\n" +
                "{\"id\":\"17020\",\"name\":\"广西柳州市东聚商贸有限公司\",\"bankNo\":\"102614040403\"},\n" +
                "{\"id\":\"15236\",\"name\":\"征腾云商购（北京）供应链管理有限公司\",\"bankNo\":\"103100010152\"},\n" +
                "{\"id\":\"12084\",\"name\":\"忻州晋龙粮油贸易有限公司\",\"bankNo\":\"103171067904\"},\n" +
                "{\"id\":\"9297\",\"name\":\"成都鹏鑫宏商贸有限公司\",\"bankNo\":\"305651000245\"},\n" +
                "{\"id\":\"14244\",\"name\":\"抚顺市顺城区多福家粮油经销处\",\"bankNo\":\"10322403011\"},\n" +
                "{\"id\":\"11053\",\"name\":\"沈阳北一新宏达粮油有限公司\",\"bankNo\":\"103221014041\"},\n" +
                "{\"id\":\"10117\",\"name\":\"沈阳市众顺泰商贸有限公司\",\"bankNo\":\"102221000809\"},\n" +
                "{\"id\":\"9405\",\"name\":\"河南油溢千家商贸有限公司\",\"bankNo\":\"102498002013\"},\n" +
                "{\"id\":\"10097\",\"name\":\"泉州市正泰米业有限公司\",\"bankNo\":\"305397023161\"},\n" +
                "{\"id\":\"15348\",\"name\":\"泊头市鑫福商贸有限公司\",\"bankNo\":\"313144105326\"},\n" +
                "{\"id\":\"17060\",\"name\":\"泰州市盐业有限公司\",\"bankNo\":\"102312802046\"},\n" +
                "{\"id\":\"17028\",\"name\":\"湖南格林山油茶科技有限公司\",\"bankNo\":\"105551005212\"},\n" +
                "{\"id\":\"9313\",\"name\":\"漳州市龙文区亚缎副食品经营部\",\"bankNo\":\"314399081443\"},\n" +
                "{\"id\":\"16132\",\"name\":\"石家庄合益荣商贸有限公司\",\"bankNo\":\"103121034880\"},\n" +
                "{\"id\":\"16148\",\"name\":\"福州快乐邦贸易有限公司\",\"bankNo\":\"103391015207\"},\n" +
                "{\"id\":\"15240\",\"name\":\"福州正德诚贸易有限公司\",\"bankNo\":\"308391026204\"},\n" +
                "{\"id\":\"10909\",\"name\":\"莆田市荔城区诚豪贸易有限公司\",\"bankNo\":\"104394023022\"},\n" +
                "{\"id\":\"8473\",\"name\":\"衡水市桃城区佳盛副食销售中心\",\"bankNo\":\"305148048019\"},\n" +
                "{\"id\":\"9289\",\"name\":\"遂宁市同创商贸有限公司\",\"bankNo\":\"103662032002\"},\n" +
                "{\"id\":\"12060\",\"name\":\"邢台粮旺商贸有限公司\",\"bankNo\":\"103131020402\"},\n" +
                "{\"id\":\"17012\",\"name\":\"防城港市港口区金峰商贸有限公司\",\"bankNo\":\"105633000017\"},\n" +
                "{\"id\":\"11856\",\"name\":\"鞍山宏业恒大商贸有限公司\",\"bankNo\":\"301223004400 \"}\n" +
                "]";
//        JSONArray jsonArray = JSON.parseArray(json);
//        for (Object obj : jsonArray) {
//            JSONObject jsonObject = (JSONObject) obj;
//            Map<String, String> map = Maps.newHashMap();
//            map.put("deptId", jsonObject.getString("部门编码"));
//            map.put("costCenterCode", jsonObject.getString("成本中心编码"));
//            map.put("costCenterName", jsonObject.getString("成本中心名称"));
//
//            System.out.println(JSONObject.toJSONString(map) + "|");
//        }

    }
}
